Revit 2022 API
GroupNode Methods
The GroupNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSymbolId
 The Id of the symbol associated with the node.
GetTransform
 A transformation matrix associated with the node.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
GroupNode Class
Autodesk.Revit.DB Namespace